{
  "2019": {
    "11": {
      "27": {
        "title": "Olá mundo!",
        "description": "Primeiro post do blog!",
        "content": "## Nada melhor do que começar com o clichê: *Olá mundo!* \n\n Bem cá estou eu, começando o primeiro post desse blog :) \n Como parte da nota final de uma disciplina da faculdade era escrever um artigo, pensei que seria uma boa ideia criar um blog para documentar o que vou aprender/aprendi durante os anos como rebocador da web. Para iniciar, peguei algumas perguntas de um FAQ para responder: \n \n # Quem sou eu? \n *Antonio* Eduardo Moreira, uma mistura de paulista com paranaense, 19 aninhos, acadêmico do curso de tecnologia em sistemas para internet na UTFPR, campus Guarapuava. Atualmente trabalho na Codeminer42 predominantemente no Front-End. \n \n # Por que começou a codar? \n Bom, eu sempre gostei bastante de tecnologia no geral, e no final de 2017, no final do ensino médio, acabei escolhendo uma faculdade que me trouxe até aqui. Conheci muitas pessoas que me ensinaram grande parte das coisas que sei hoje, e sou bastante feliz com a profissão. \n \n # Back ou front? \n Como comentei acima, atualmente na Codeminer, eu sou mais front, trabalhando bastante com react (esse blog também é feito em react por sinal), mas na minha empresa antiga eu era mais back do que front. Afinal de contas eu gosto dos dois, é mais uma questão de 'fase'. \n \n # Primeira linguagem? \n Eu comecei mesmo a programar de fato na faculdade, e como na maioria das faculdades, eles apresentam para os alunos Java, comigo não foi diferente, comecei com Java, confesso que tenho um certo amor e ódio pela linguagem. \n \n # Linguagem favorita? \n Eu não tenho uma linguagem favorita, na empresa antiga eu trabalhava praticamente 100% do tempo com PHP, atualmente mexo muito pouco com PHP, mais JavaScript e Ruby. Gosto bastante dessas comunidades do JS e Ruby. \n \n Acho que era isso, em breve pretendo postar coisas mais técnicas, desde já, valeu!",
        "images": [],
        "tags": []
      }
    }
  }
}
